import 'https://cdn.jsdelivr.net/gh/orestbida/cookieconsent@3.0.1/dist/cookieconsent.umd.js';

const theme = (() => {
	if (typeof localStorage !== 'undefined' && localStorage.getItem('theme')) {
		return localStorage.getItem('theme');
	}
	if (window.matchMedia('(prefers-color-scheme: dark)').matches) {
		return 'dark';
	}
	return 'light';
})();

if (theme === 'dark') {
	// Enable dark mode
	document.documentElement.classList.add('cc--darkmode');
}

CookieConsent.run({
	guiOptions: {
		consentModal: {
			layout: 'bar',
			position: 'bottom',
			equalWeightButtons: true,
			flipButtons: false,
		},
		preferencesModal: {
			layout: 'bar',
			position: 'right',
			equalWeightButtons: true,
			flipButtons: false,
		},
	},
	categories: {
		necessary: {
			readOnly: true,
		},
		analytics: {},
	},
	language: {
		default: 'en',
		autoDetect: 'browser',
		translations: {
			en: {
				consentModal: {
					title: '🍪 We use cookies!',
					description:
						'เราใช้คุกกี้ในการให้บริการและปรับปรุงบริการของเรา ตลอดจนเพิ่มประสิทธิภาพให้แก่ประสบการณ์การเรียกดูข้อมูลของคุณ คุณสามารถทราบรายละเอียดเกี่ยวกับคุกกี้ <a href="/cookie-policy">ได้ที่นี้</a>',
					acceptAllBtn: 'Accept all',
					acceptNecessaryBtn: 'Reject all',
					showPreferencesBtn: 'Manage preferences',
					// footer: '<a href="/cookie-policy">Cookie Policy</a>',
				},
				preferencesModal: {
					title: 'Consent Preferences Center',
					acceptAllBtn: 'Accept all',
					acceptNecessaryBtn: 'Reject all',
					savePreferencesBtn: 'Save preferences',
					closeIconLabel: 'Close modal',
					serviceCounterLabel: 'Service|Services',
					sections: [
						{
							title: 'Cookie usage 📢',
							description:
								'เราใช้คุกกี้เพื่อการทำงานของเว็บไซต์และเพิ่มประสิทธิภาพให้แก่ประสบการณ์การเรียกดูข้อมูลของผู้ใช้ และผู้ใช้สามารถเลือกตั้งค่าคุกกี้ได้เอง สำหรับรายละเอียดเพิ่มเติมเกี่ยวกับคุกกี้และข้อมลสำคัญอื่น ๆ สามารถคลิกอ่านตัวเต็มได้ : การคุ้มครองข้อมูลส่วนบุคคล',
						},
						{
							title: 'คุกกี้ที่จำเป็น <span class="pm__badge">Always Enabled</span>',
							description:
								'เป็นคุกกี้ที่จำเป็นสำหรับการทำงานของเว็บไซต์ หากไม่มีคุกกี้เหล่านี้เว็บไซต์จะทำงานไม่ถูกต้อง',
							linkedCategory: 'necessary',
						},
						{
							title: 'คุกกี้เพื่อการวิเคราะห์',
							description:
								'คุกกี้ประเภทนี้ใช้เก็บข้อมูลพฤติกรรมการเข้าชมเว็บไซต์ของผู้ใช้ เพื่อนำมาวิเคราะห์สำหรับการปรับปรุงและพัฒนาเว็บไซต์ให้มีประสิทธิภาพ ซึ่งข้อมูลที่รวบรวมไว้ทั้งหมดจะถูกวิเคราะห์แบบไม่ระบุตัวบุคคล',
							linkedCategory: 'analytics',
						},
						{
							title: 'คุกกี้เพื่อการตลาด',
							description:
								'คุกกี้ประเภทนี้ใช้ติดตามพฤติกรรมผู้เข้าชมเว็บไซต์ เพื่อแสดงโฆษณาที่เหมาะสมสำหรับผู้ใช้งานแต่ละราย และเพื่อเพิ่มประสิทธิผลการโฆษณาสำหรับผู้เผยแพร่และผู้โฆษณาบุคคลที่สาม',
							linkedCategory: 'marketing',
						},
						// {
						// 	title: 'More information',
						// 	description:
						// 		'For any query in relation to my policy on cookies and your choices, please <a class="cc__link" href="#yourdomain.com">contact me</a>.',
						// },
					],
				},
			},
		},
	},
});
